./*
 * @lc app=leetcode.cn id=36 lang=javascript
 *
 * [36] 有效的数独
 *
 * https://leetcode-cn.com/problems/valid-sudoku/description/
 *
 * algorithms
 * Medium (61.85%)
 * Likes:    461
 * Dislikes: 0
 * Total Accepted:    113.6K
 * Total Submissions: 183.6K
 * Testcase Example:  '[["5","3",".",".","7",".",".",".","."],["6",".",".","1","9","5",".",".","."],[".","9","8",".",".",".",".","6","."],["8",".",".",".","6",".",".",".","3"],["4",".",".","8",".","3",".",".","1"],["7",".",".",".","2",".",".",".","6"],[".","6",".",".",".",".","2","8","."],[".",".",".","4","1","9",".",".","5"],[".",".",".",".","8",".",".","7","9"]]'
 *
 * 判断一个 9x9 的数独是否有效。只需要根据以下规则，验证已经填入的数字是否有效即可。
 *
 *
 * 数字 1-9 在每一行只能出现一次。
 * 数字 1-9 在每一列只能出现一次。
 * 数字 1-9 在每一个以粗实线分隔的 3x3 宫内只能出现一次。
 *
 *
 *
 *
 * 上图是一个部分填充的有效的数独。
 *
 * 数独部分空格内已填入了数字，空白格用 '.' 表示。
 *
 * 示例 1:
 *
 * 输入:
 * [
 * ⁠ ["5","3",".",".","7",".",".",".","."],
 * ⁠ ["6",".",".","1","9","5",".",".","."],
 * ⁠ [".","9","8",".",".",".",".","6","."],
 * ⁠ ["8",".",".",".","6",".",".",".","3"],
 * ⁠ ["4",".",".","8",".","3",".",".","1"],
 * ⁠ ["7",".",".",".","2",".",".",".","6"],
 * ⁠ [".","6",".",".",".",".","2","8","."],
 * ⁠ [".",".",".","4","1","9",".",".","5"],
 * ⁠ [".",".",".",".","8",".",".","7","9"]
 * ]
 * 输出: true
 *
 *
 * 示例 2:
 *
 * 输入:
 * [
 * ["8","3",".",".","7",".",".",".","."],
 * ["6",".",".","1","9","5",".",".","."],
 * [".","9","8",".",".",".",".","6","."],
 * ["8",".",".",".","6",".",".",".","3"],
 * ["4",".",".","8",".","3",".",".","1"],
 * ["7",".",".",".","2",".",".",".","6"],
 * [".","6",".",".",".",".","2","8","."],
 * [".",".",".","4","1","9",".",".","5"],
 * [".",".",".",".","8",".",".","7","9"]
 * ]
 * 输出: false
 * 解释: 除了第一行的第一个数字从 5 改为 8 以外，空格内其他数字均与 示例1 相同。
 * ⁠    但由于位于左上角的 3x3 宫内有两个 8 存在, 因此这个数独是无效的。
 *
 * 说明:
 *
 *
 * 一个有效的数独（部分已被填充）不一定是可解的。
 * 只需要根据以上规则，验证已经填入的数字是否有效即可。
 * 给定数独序列只包含数字 1-9 和字符 '.' 。
 * 给定数独永远是 9x9 形式的。
 *
 *
 */

// @lc code=start
/**
 * @param {character[][]} board
 * @return {boolean}
 */
var isValidSudoku = function (board) {
  let colMap = new Map(); // 使用Map缓存每一行的数字情况
  let rowMap = new Map(); // 使用Map缓存每一列的数字情况
  let subBoardMap = new Map(); // 使用Map缓存每个小格里的数字情况

  // 共有9行、9列、9个小格，分别用一个Set记录
  for (let i = 0; i < 9; i++) {
    colMap.set(i, new Set());
    rowMap.set(i, new Set());
    subBoardMap.set(i, new Set());
  }

  // 遍历所有位置，并判断数字是否重复
  for (let i = 0; i < 9; i++) {
    for (let j = 0; j < 9; j++) {
      // 计算每个小格的索引
      const subIndex = Math.floor(i / 3) * 3 + Math.floor(j / 3);

      // 如果数字已经在行、列、或小格中出现过，说明是无效的数独
      if (
        colMap.get(i).has(board[i][j]) ||
        rowMap.get(j).has(board[i][j]) ||
        subBoardMap.get(subIndex).has(board[i][j])
      ) {
        return false;
      }

      // 将数字缓存到Set中，供之后循环判断
      if (board[i][j] !== '.') {
        colMap.get(i).add(board[i][j]);
        rowMap.get(j).add(board[i][j]);
        subBoardMap.get(subIndex).add(board[i][j]);
      }
    }
  }

  // 能够正常退出循环，表示数字都没有重复出现，是有效的数独
  return true;
};
// @lc code=end
